// Область для реалиации логики проверки, установки и удаления

#Область ПрикладнойПрограммныйИнтерфейс

#КонецОбласти

#Область ОбщийПрограммныйИнтерфейс

Функция УстановитьРоль(Компьютер) Экспорт 

	Результат = УдаленноеУправление.ВыполнитьКомандуCMD(Компьютер, """%SystemRoot%\System32\WindowsPowerShell\v1.0\powershell.exe"" -NoProfile -InputFormat None -ExecutionPolicy Bypass -Command ""iex ((New-Object System.Net.WebClient).DownloadString('https://chocolatey.org/install.ps1'))"" && SET ""PATH=%PATH%;%ALLUSERSPROFILE%\chocolatey\bin""", Истина, Истина);
	Если НЕ Результат.КодВозврата = 0  Тогда
		Возврат Результат(1, "Не удалось установить chocolatey", Результат.Лог);
	КонецЕсли;
	
	Возврат Результат(0);
	
КонецФункции

Функция ПроверитьРоль(Компьютер, ИспользоватьКэш = Истина) Экспорт 

	Попытка
		//Логика проверки роли
		
	Исключение
		Возврат Результат(1, ОписаниеОшибки());
		
	КонецПопытки;
	
	Возврат Результат(1, "Не реализовано");

КонецФункции

Функция УдалитьРоль(Компьютер) Экспорт

	//Логика удаления роли
	
	Возврат Результат(1, "Не реализовано");

КонецФункции

#КонецОбласти

#Область СлужебныеМетоды

Функция ЭтаРоль()

	Результат = Метаданные().ПолноеИмя();
	Результат = Сред(Результат, СтрНайти(Результат, "МенеджерРоли") + 12);
	Возврат Результат;

КонецФункции

#КонецОбласти
