//СервисHTTP.ТаблицаЗначенийВМассивСтруктур(Таблица);
//СервисHTTP.МассивСтруктурВТаблицуЗначений(Массив);

&НаСервере
Процедура ПередатьНоменклатуруПоБитымСсылкамВУстановкахЦенНаСервере(ТекущаяСтрока)

	Попытка
		ТекущийОбъект = РеквизитФормыВЗначение("Объект");
		Получатель = ТекущаяСтрока.Узел.ПолучитьОбъект();
		Отправитель = ПланОбмена.ГлавныйУзел.ПолучитьОбъект();
		
		Код1 = ТекущийОбъект.ПолучитьМакет("ПолучитьСсылкиБитойНоменклатурыИзУстановокЦен").ПолучитьТекст();
		МассивСсылок = Фастекс.ВыполнитьКод(Получатель.Ссылка, Код1);
		
		Если МассивСсылок.Количество() = 0 Тогда
			//Сообщить("" + Получатель.Код + ": ok");
			Возврат;
		КонецЕсли;
		
		МассивОбъектов = Фастекс.ПолучитьОбъекты(Отправитель, Фастекс.Сериализовать(МассивСсылок));
		Результат = Фастекс.ОтправитьИзменения(ПланОбмена, Отправитель, Получатель, МассивОбъектов);
		
		ОшибкиЗагрузки = Результат.Получить("ОшибкиЗагрузки");
		Для каждого Ошибка Из ОшибкиЗагрузки Цикл
			Сообщить("" + Получатель.Код + ": " + Ошибка);
		КонецЦикла;
		ЗагруженныеОбъекты = Результат.Получить("ЗагруженныеОбъекты");
		Сообщить("" + Получатель.Код + ": загружено " + ЗагруженныеОбъекты.Количество());
	
	Исключение
		Сообщить("" + Получатель.Код + ": " + ОписаниеОшибки());
	
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередатьНоменклатуруПоБитымСсылкамВУстановкахЦен(Команда)

	Сообщить("Начало: " + ТекущаяДата());
	
	Для каждого ТекущаяСтрока Из Элементы.Список.ВыделенныеСтроки Цикл
		ПередатьНоменклатуруПоБитымСсылкамВУстановкахЦенНаСервере(ТекущаяСтрока);
	КонецЦикла;
	
	Сообщить("Окончание: " + ТекущаяДата());
	
КонецПроцедуры

&НаСервере
Процедура ПередатьСоответствияПоПустойНоменклатуреТТННаСервере(ТекущаяСтрока)


	Попытка
		ТекущийОбъект = РеквизитФормыВЗначение("Объект");
		Получатель = ТекущаяСтрока.Узел.ПолучитьОбъект();
		Отправитель = ПланОбмена.ГлавныйУзел.ПолучитьОбъект();
		
		Код = ТекущийОбъект.ПолучитьМакет("ПолучитьСсылкиАПИзПустыхСтрокВПоступлениях").ПолучитьТекст();
		МассивСсылок = Фастекс.ВыполнитьКод(Получатель.Ссылка, Код);
		
		Если МассивСсылок.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		Код = ТекущийОбъект.ПолучитьМакет("ПолучитьСоответствияПоМассивуСсылокАП").ПолучитьТекст();
		ВходящиеПараметры = Новый Структура("Массив", МассивСсылок);
		МассивОбъектов = Фастекс.ВыполнитьКод(Отправитель.Ссылка, Код, ВходящиеПараметры);
		Результат = Фастекс.ОтправитьИзменения(ПланОбмена, Отправитель, Получатель, Фастекс.Сериализовать(МассивОбъектов));
		
		ОшибкиЗагрузки = Результат.Получить("ОшибкиЗагрузки");
		Для каждого Ошибка Из ОшибкиЗагрузки Цикл
			Сообщить("" + Получатель.Код + ": " + Ошибка);
		КонецЦикла;
		ЗагруженныеОбъекты = Результат.Получить("ЗагруженныеОбъекты");
		Сообщить("" + Получатель.Код + ": загружено " + ЗагруженныеОбъекты.Количество());
	
	Исключение
		Сообщить("" + Получатель.Код + ": " + ОписаниеОшибки());
	
	КонецПопытки;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередатьСоответствияПоПустойНоменклатуреТТН(Команда)

	Сообщить("Начало: " + ТекущаяДата());
	
	Для каждого ТекущаяСтрока Из Элементы.Список.ВыделенныеСтроки Цикл
		ПередатьСоответствияПоПустойНоменклатуреТТННаСервере(ТекущаяСтрока);
	КонецЦикла;
	
	Сообщить("Окончание: " + ТекущаяДата());
	
КонецПроцедуры
