Процедура ПередЗаписью(Отказ)
	
	РегистрыСведений.РолиКомпьютеров.ОбновитьДляКомпьютера(Ссылка);
	Если ПустаяСтрока(IP) Тогда
		IP = "?";
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьДанные(Инфо = Неопределено) Экспорт

	ОбновитьРеквизиты("Наименование", Инфо, "computername");
	ОбновитьРеквизиты("ВерсияОС", Инфо, "osversion");
	ОбновитьРеквизиты("ВерсияПлатформы", Инфо, "platformversion");
	ОбновитьРеквизиты("ТипПлатформы", Инфо, "platformtype");
	ОбновитьРеквизиты("Память", Инфо, "memory");
	ОбновитьРеквизиты("Процессор", Инфо, "cpu");
	
	Инфо_Разрядность = ОпределитьРазрядность(Инфо);
	Если НЕ Разрядность = Инфо_Разрядность Тогда
		Разрядность = Инфо_Разрядность;
	КонецЕсли;
	
	Если ПроверкаИзмененности.ОбъектИзменен(ЭтотОбъект) Тогда
		Записать();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьРеквизиты(ИмяРеквизита, Инфо, ИмяСвойства)

	Если НЕ СокрЛП(ЭтотОбъект[ИмяРеквизита]) = СокрЛП(Инфо[ИмяСвойства]) Тогда
		ЭтотОбъект[ИмяРеквизита] = СокрЛП(Инфо[ИмяСвойства]);
	КонецЕсли;

КонецПроцедуры


Функция ОпределитьРазрядность(Инфо)

	Если СтрНайти(Инфо.platformtype, "64") Тогда
		Возврат "64";
	ИначеЕсли  СтрНайти(Инфо.bindir, "86)") Тогда
		Возврат "64";
	Иначе
		Возврат "32";
	КонецЕсли;

КонецФункции
