Функция ФайлСуществует(ИмяФайла) Экспорт

	Файл = Новый Файл(ИмяФайла);
	Возврат Файл.Существует();

КонецФункции

Функция ФайлПоявился(ИмяФайла) Экспорт

	Для х = 1 По 1000 Цикл
		Попытка
			Файл = Новый Файл(ИмяФайла);
			Если Файл.Существует() Тогда
				Размер = Файл.Размер();
				Возврат Истина;
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция УдалитьФайл(ИмяФайла) Экспорт

	Для х = 1 По 1000 Цикл
		Попытка
			УдалитьФайлы(ИмяФайла);
			Возврат Истина;
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция ИмяФайла(ПолноеИмяФайла) Экспорт

	Файл = Новый Файл(ПолноеИмяФайла);
	Возврат Файл.Имя;

КонецФункции

Функция ИмяФайлаБезРасширения(ПолноеИмяФайла) Экспорт

	Файл = Новый Файл(ПолноеИмяФайла);
	Возврат Файл.ИмяБезРасширения;

КонецФункции

Функция РасширениеФайла(ПолноеИмяФайла) Экспорт

	Файл = Новый Файл(ПолноеИмяФайла);
	Возврат НРег(Файл.Расширение);

КонецФункции
