// Область для реалиации логики проверки, установки и удаления

#Область ПрикладнойПрограммныйИнтерфейс

Функция ОтключитьЗащитуОтОпасныхДействий(Компьютер) Экспорт
	
	Каталог = "C:\Program Files (x86)\1Cv8\conf\";
	Возврат УдаленноеУправление.ВыполнитьКомандуCMD(Компьютер, СтрШаблон("copy ""%1conf.cfg"" ""%2conf.cfg"" /y", УдаленноеУправление.КаталогДистрибутивов(), Каталог));
	
КонецФункции

#КонецОбласти

#Область ОбщийПрограммныйИнтерфейс

Функция УстановитьРоль(Компьютер) Экспорт 

	//Логика установки роли
	
	Возврат Результат(0);
	
КонецФункции

Функция ПроверитьРоль(Компьютер, ИспользоватьКэш = Истина) Экспорт 

	Попытка
		//Логика проверки роли
		
	Исключение
		Возврат Результат(1, ОписаниеОшибки());
		
	КонецПопытки;
	
	Возврат Результат(1, "Не получен ответ от сервера");

КонецФункции

Функция УдалитьРоль(Компьютер) Экспорт

	//Логика удаления роли
	
	Возврат Результат(0);

КонецФункции

#КонецОбласти

#Область СлужебныеМетоды

Функция ЭтаРоль()

	Результат = Метаданные().ПолноеИмя();
	Результат = Сред(Результат, СтрНайти(Результат, "МенеджерРоли") + 12);
	Возврат Результат;

КонецФункции

#КонецОбласти
