&НаСервере
Процедура ИзменитьВерсии(ТекущаяСтрока, Действие, Сторона, Версия, ЗаменяемаВерсия = Неопределено)
	
	об = ТекущаяСтрока.Ссылка.ПолучитьОбъект();
	Если Ложь Тогда об = Справочники.ПравилаКонвертации.СоздатьЭлемент() КонецЕсли;
	Если Действие = "Заменить" Тогда
		Если Сторона = "Отправитель" Тогда
			стр = об.ВерсииОтправителя.Найти(ЗаменяемаВерсия);
			Если НЕ стр = Неопределено Тогда
				стр.Версия = Версия;
			КонецЕсли;
			
		Иначе
			стр = об.ВерсииПолучателя.Найти(ЗаменяемаВерсия);
			Если НЕ стр = Неопределено Тогда
				стр.Версия = Версия;
			КонецЕсли;
		
		КонецЕсли;
		
	ИначеЕсли Действие = "Добавить" Тогда
		Если Сторона = "Отправитель" Тогда
			стр = об.ВерсииОтправителя.Найти(ЗаменяемаВерсия);
			Если стр = Неопределено Тогда
				стр = об.ВерсииОтправителя.Добавить();
				стр.Версия = Версия;
			КонецЕсли;
			
		Иначе
			стр = об.ВерсииПолучателя.Найти(ЗаменяемаВерсия);
			Если стр = Неопределено Тогда
				стр = об.ВерсииПолучателя.Добавить();
				стр.Версия = Версия;
			КонецЕсли;
		
		КонецЕсли;
		
	ИначеЕсли Действие = "Удалить" Тогда
		Если Сторона = "Отправитель" Тогда
			стр = об.ВерсииОтправителя.Найти(ЗаменяемаВерсия);
			Если НЕ стр = Неопределено Тогда
				об.ВерсииОтправителя.Удалить(стр);
			КонецЕсли;
			
		Иначе
			стр = об.ВерсииПолучателя.Найти(ЗаменяемаВерсия);
			Если НЕ стр = Неопределено Тогда
				об.ВерсииПолучателя.Удалить(стр);
			КонецЕсли;
		
		КонецЕсли;
		
	КонецЕсли;
	
	об.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВерсиюОтправителя(Команда)
	
	Для каждого ТекущаяСтрока Из Элементы.Список.ВыделенныеСтроки Цикл
		ИзменитьВерсии(ТекущаяСтрока, "Добавить", "Отправитель", Версия);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьВерсиюОтправителя(Команда)
	
	Для каждого ТекущаяСтрока Из Элементы.Список.ВыделенныеСтроки Цикл
		ИзменитьВерсии(ТекущаяСтрока, "Заменить", "Отправитель", Версия, ЗаменяемаяВерсия);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВерсиюОтправителя(Команда)
	
	Для каждого ТекущаяСтрока Из Элементы.Список.ВыделенныеСтроки Цикл
		ИзменитьВерсии(ТекущаяСтрока, "Удалить", "Отправитель", Версия);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВерсиюПолучателя(Команда)
	
	Для каждого ТекущаяСтрока Из Элементы.Список.ВыделенныеСтроки Цикл
		ИзменитьВерсии(ТекущаяСтрока, "Добавить", "Получатель", Версия);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьВерсиюПолучателя(Команда)
	
	Для каждого ТекущаяСтрока Из Элементы.Список.ВыделенныеСтроки Цикл
		ИзменитьВерсии(ТекущаяСтрока, "Заменить", "Получатель", Версия, ЗаменяемаяВерсия);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВерсиюПолучателя(Команда)
	
	Для каждого ТекущаяСтрока Из Элементы.Список.ВыделенныеСтроки Цикл
		ИзменитьВерсии(ТекущаяСтрока, "Удалить", "Получатель", Версия);
	КонецЦикла;
	
КонецПроцедуры
