Функция СинхронизироватьСРТ() Экспорт
	
	ПараметрыЗапроса = Новый Структура("code, plan, format", "all", "Помагазину", "json");
	ДополнительныеПараметры = Новый Структура("ПараметрыПреобразованияJSON", Новый Структура("ПрочитатьВСоответствие", Ложь));
	Таблица = КоннекторHTTP.PostJson("http://Администратор:1541@srv-rozn-sql:5080/retail/hs/fastex/nodes", ПараметрыЗапроса, ДополнительныеПараметры);
	
	КоличествоНовых = 0;
	КоличествоИзмененных = 0;
	Для каждого Запись Из Таблица Цикл
	
		Ссылка = НайтиПоКоду(СокрЛП(Запись.Код));
		Если Ссылка.Пустая() Тогда
			Подразделение = СоздатьЭлемент();
		Иначе
			Подразделение = Ссылка.ПолучитьОбъект();
		КонецЕсли;
		
		Подразделение.Код = СокрЛП(Запись.Код);
		Подразделение.Наименование = СокрЛП(Запись.Наименование);
		Подразделение.Подсеть = ПолучитьПодсетьИзIP(Запись.IP);
		Подразделение.Записать();
		
		Компьютер = Справочники.Компьютеры.НайтиПоКоду(Подразделение.Код);
		Если НЕ Компьютер.Пустая() Тогда
			Компьютер = Компьютер.ПолучитьОбъект();
			Если ПустаяСтрока(Компьютер.IP) ИЛИ Компьютер.IP = "?" Тогда
				Компьютер.IP = СокрЛП(АдресПодсети(Запись.IP, 2));
			КонецЕсли;
		Иначе
			Компьютер = Справочники.Компьютеры.СоздатьЭлемент();
			Компьютер.Наименование = "???";
			КоличествоНовых = КоличествоНовых + 1;
			Компьютер.IP = СокрЛП(АдресПодсети(Запись.IP, 2));
		КонецЕсли;
		Компьютер.Код = Подразделение.Код;
		Компьютер.Подразделение = Подразделение.Ссылка;
		Компьютер.Записать();
		РегистрыСведений.РолиКомпьютеров.Назначить(Компьютер.Ссылка, "Apache");
		РегистрыСведений.РолиКомпьютеров.Назначить(Компьютер.Ссылка, "Клиент 1С");
	
		ИБ = Справочники.ИнформационныеБазы.НайтиПоКоду(Подразделение.Код);
		Если НЕ ИБ.Пустая() Тогда
			ИБ = ИБ.ПолучитьОбъект();
		Иначе
			ИБ = Справочники.ИнформационныеБазы.СоздатьЭлемент();
		КонецЕсли;
		ИБ.Код = Подразделение.Код;
		ИБ.Наименование = "РТ, " + Подразделение.Наименование;
		ИБ.Компьютер = Компьютер.Ссылка;
		Если ПроверкаИзмененности.ОбъектИзменен(ИБ) Тогда
			Если НЕ ИБ.ЭтоНовый() Тогда
				КоличествоИзмененных = КоличествоИзмененных + 1;
			КонецЕсли;
			ИБ.Записать();
		КонецЕсли;
	
	КонецЦикла;
	
	Сообщить(СтрШаблон("Новых: %1, измененных: %2", КоличествоНовых, КоличествоИзмененных));
	
КонецФункции
 
Функция ПолучитьПодсетьИзIP(Знач IP)
	Возврат АдресПодсети(IP, "0");
КонецФункции

Функция АдресПодсети(Знач IP, Номер)

	IP = СокрЛП(СтрЗаменить(IP, " ", ""));
	Позиция = СтрНайти(IP, ".", , , 3);
	Если Позиция > 0 Тогда
		IP = Лев(IP, Позиция) + Номер;	
	КонецЕсли;
	
	Возврат IP;

КонецФункции
