// Область для реалиации логики проверки, установки и удаления

#Область ПрикладнойПрограммныйИнтерфейс

#КонецОбласти

#Область ОбщийПрограммныйИнтерфейс

Функция УстановитьРоль(Компьютер) Экспорт 

	Попытка
		//Логика проверки роли
		
	Исключение
		Возврат Результат(1, ОписаниеОшибки());
		
	КонецПопытки;
	
	Возврат Результат(0);
	
КонецФункции

Функция ПроверитьРоль(Компьютер) Экспорт 

	Попытка
		
		Результат = УдаленноеУправление.ВыполнитьКомандуCMD(Компьютер, "oscript -v > out & set /p ver= < out & del out & echo temp:%ver%
			|oscript -v > out & set /p ver= < out & del out & echo oscriptversion:%ver%");
		Если Результат.КодВозврата = 0 Тогда
			Версия = УдаленноеУправление.ПолучитьЗначениеИзЛога(Результат.Лог, "oscriptversion");
			Если ПустаяСтрока(Версия) Тогда
				Результат.КодВозврата = 1;
			КонецЕсли;
			РегистрыСведений.СвойстваКомпьютеров.ЗаписатьСвойство(Компьютер, , "OneScript", ?(ПустаяСтрока(Версия), 0, 1));
			РегистрыСведений.СвойстваКомпьютеров.ЗаписатьСвойство(Компьютер, , "OneScript.Version", Версия);
		КонецЕсли;
		
		Возврат Результат.КодВозврата = 0;
		
		
	Исключение
		Возврат Результат(1, ОписаниеОшибки());
		
	КонецПопытки;
	
	Возврат Результат(1, "Не реализовано");

КонецФункции

Функция УдалитьРоль(Компьютер) Экспорт

	//Логика удаления роли
	
	Возврат Результат(1, "Не реализовано");

КонецФункции

#КонецОбласти

#Область СлужебныеМетоды

Функция ЭтаРоль()

	Результат = Метаданные().ПолноеИмя();
	Результат = Сред(Результат, СтрНайти(Результат, "МенеджерРоли") + 12);
	Возврат Результат;

КонецФункции

#КонецОбласти
