&НаСервере
Процедура УстановитьНаСервере()
	
	Для каждого ТекущаяСтрока Из Элементы.Список.ВыделенныеСтроки Цикл
		СостояниеРоли = РегистрыСведений.РолиКомпьютеров.Состояние(ТекущаяСтрока.Компьютер, ТекущаяСтрока.Роль);
		Если СостояниеРоли.Назначена И НЕ СостояниеРоли.Установлена Тогда
			РегистрыСведений.РолиКомпьютеров.НачатьВыполнениеОперации(ТекущаяСтрока.Компьютер, Текущаястрока.Роль, "УстановитьРоль");
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Установить(Команда)
	
	УстановитьНаСервере();
	
КонецПроцедуры
