// Область для реалиации логики проверки, установки и удаления

#Область ПрикладнойПрограммныйИнтерфейс

Функция ВыполнитьНекоеДействие(Компьютер) Экспорт

	//Логика установки роли
	
	//Примеры
	
	//Проверка доступности компьютера через IPC
	Результат = УдаленноеУправление.IPCДоступен(Компьютер);
	Если Не Результат.КодВозврата = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	//Выполнение команды с помощью CMD
	Результат = УдаленноеУправление.ВыполнитьCMD(Компьютер, "echo Hello World!");
	Если Не Результат.КодВозврата = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	//Проверка наличия OneScript
	Результат = УдаленноеУправление.OneScriptДоступен(Компьютер);
	Если Не Результат.КодВозврата = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	//Выполнение команды с помощью OneScript
	Скрипт = УдаленноеУправление.СоздатьСкрипт();
	Результат = УдаленноеУправление.ВыполнитьOneScript(Компьютер, Скрипт);
	Если Не Результат.КодВозврата = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	Возврат Результат(0);
	
КонецФункции // ()

#КонецОбласти

#Область ОбщийПрограммныйИнтерфейс

Функция УстановитьРоль(Компьютер) Экспорт 

	//Логика установки роли
	
	Возврат Результат(0);
	
КонецФункции

Функция ПроверитьРоль(Компьютер, ИспользоватьКэш = Истина) Экспорт 

	Попытка
		//Логика проверки роли
		
	Исключение
		Возврат Результат(1, ОписаниеОшибки());
		
	КонецПопытки;
	
	Возврат Результат(1, "Не получен ответ от сервера");

КонецФункции

Функция УдалитьРоль(Компьютер) Экспорт

	//Логика удаления роли
	
	Возврат Результат(0);

КонецФункции

#КонецОбласти

#Область СлужебныеМетоды

// Подготавливает стандартный ответ для функции
//Параметры
//	КодВозврата - Число, 0 - ОК, иначе код ошибки (если коды не предусмотрены, то 1)
//	ОписаниеОшибки - Строка - Объяснение сусти проблемы, когда КодВозврата <> 0
//	Лог - Строка - Лог выполнения операции, например стандартный вывод, полученный  при выполнении метода УдаленноеУправление.ВыполнитьCMD
Функция Результат(КодВозврата, ОписаниеОшибки = "", Лог = "")

	Возврат Новый Структура("КодВозврата, ОписаниеОшибки, Лог", КодВозврата, ОписаниеОшибки, Лог);

КонецФункции

Функция ЭтаРоль()

	Результат = Метаданные().ПолноеИмя();
	Результат = Сред(Результат, СтрНайти(Результат, "МенеджерРоли") + 12);
	Возврат Результат;

КонецФункции

#КонецОбласти
