&НаСервере
Процедура ОбновитьСписокТипов()
	
	Массив = Фастекс.СоставОчереди(Объект.ПланОбмена);
	Элементы.ИмяТипа.СписокВыбора.ЗагрузитьЗначения(Массив);
	Элементы.ИмяТипа.СписокВыбора.СортироватьПоЗначению();
	
КонецПроцедуры

&НаКлиенте
Процедура ПланОбменаПриИзменении(Элемент)
	ОбновитьСписокТипов();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьСписокТипов();
КонецПроцедуры

&НаКлиенте
Процедура Примеры(Команда)
	Объект.КодКонвертации = Объект.КодКонвертации + "
	|//Отказ = Истина; //элемент не будет отправлен в базу-приемник
	|//
	|//Элемент = ПолучитьЭлементDOM(ТекущийОбъектDOM, <ИмяРеквизита>);
	|//Если НЕ Элемент = Неопределено Тогда
	|//	Значение = Элемент.ТекстовоеСодержимое;
	|//КонецЕсли;
	|//
	|//ДобавитьЭлементDOM(ДокументОбъектаDOM, ТекущийОбъектDOM, <ИмяРеквизита>, <?ЗначениеРеквизита>); //добавляет элемент в конец объекта
	|//УдалитьЭлементDOM(ТекущийОбъектDOM, <ИмяРеквизита>);
	|//ВставитьЭлементDOM(ДокументОбъектаDOM, ТекущийОбъектDOM, <ИмяРеквизита>, <ИмяРеквизитаПеред>, <?Значение>);
	|//ПереместитьЭлементDOM(ДокументОбъектаDOM, ТекущийОбъектDOM, <ИмяРеквизита>, <?ИмяРеквизитаПеред>);
	|
	|//ЭлементыDOM = ТекущийОбъектDOM.ПолучитьЭлементыПоИмени(""*"", Имя);
	|//Для каждого ЭлементDOM Из ЭлементыDOM Цикл
	|//	ДобавитьЭлементDOM(ДокументОбъектаDOM, ЭлементDOM, <ИмяРеквизита>, <?ЗначениеРеквизита>)
	|//	Возврат ЭлементDOM;
	|//КонецЦикла;";

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Оповестить();
КонецПроцедуры
