Функция ПараметрСеанса(Имя, Значение = Неопределено) Экспорт

	Если НЕ Значение = Неопределено Тогда
		ПараметрыСеанса[Имя] = Значение;
	КонецЕсли;
	
	Возврат ПараметрыСеанса[Имя];

КонецФункции

Функция РеквизитОбъекта(Объект, Реквизит) Экспорт 
	Возврат Объект[Реквизит];
КонецФункции

Процедура ЗаписатьСвойствоКомпьтера(Компьютер, Роль, Свойство, Значение) Экспорт 
	РегистрыСведений.СвойстваКомпьютеров.ЗаписатьСвойство(Компьютер, Роль, Свойство, Значение); 
КонецПроцедуры

Функция ПолучитьСвойствоКомпьютера(Компьютер, Роль, Свойство) Экспорт
	Возврат РегистрыСведений.СвойстваКомпьютеров.ПолучитьСвойство(Компьютер, Роль, Свойство);
КонецФункции

Функция ПолучитьРоль(Роль) Экспорт
	Возврат РегистрыСведений.РолиКомпьютеров.Роль(Роль);
КонецФункции
