Функция СтрокаИзФайла(ИмяФайла, Кодировка = "UTF8") Экспорт

	Если ФайловаяСистема.ФайлПоявился(ИмяФайла) Тогда
		Чтение = Новый ЧтениеТекста(ИмяФайла, Кодировка);
		Строка = Чтение.Прочитать();
		Чтение.Закрыть();
	Иначе
		Строка = "Файл не найден";
	КонецЕсли;
	
	Возврат Строка;
	
КонецФункции

Функция ТекстИзФайла(ИмяФайла, Кодировка = "UTF8") Экспорт

	Текст = Новый ТекстовыйДокумент;
	Если ФайловаяСистема.ФайлПоявился(ИмяФайла) Тогда
		Текст.Прочитать(ИмяФайла, Кодировка);
	КонецЕсли;
	
	Возврат Текст;
	
КонецФункции

Функция ТекстИзСтроки(Строка) Экспорт

	Текст = Новый ТекстовыйДокумент;
	Текст.УстановитьТекст(Строка);
	Возврат Текст;

КонецФункции

Функция НайтиВТексте(Текст, Подстрока, НомерВхождения = 1) Экспорт

	СчетчикВхождения = 0;
	Для х = 0 По Текст.КоличествоСтрок()-1 Цикл
		Строка = Текст.ПолучитьСтроку(х);
		Если СтрНайти(Строка, Подстрока) > 0 Тогда
			СчетчикВхождения = СчетчикВхождения + 1;
			Если СчетчикВхождения = НомерВхождения Тогда
				Возврат х;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат 0;

КонецФункции // ()
