Процедура ОбновитьГруппировкиПоФразам() Экспорт 

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	*
	               |ИЗ
	               |	РегистрСведений.ЛогОбмена КАК Лог
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлючевыеФразыЛогаОбмена КАК Фразы
	               |		ПО Лог.Группировка = Фразы.Фраза
	               |ГДЕ
	               |	Фразы.Фраза ЕСТЬ NULL";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Набор = РегистрыСведений.ЛогОбмена.СоздатьНаборЗаписей();
		Набор.Отбор.Узел.Установить(Выборка.Узел, Истина);
		Набор.Отбор.Дата.Установить(Выборка.Дата, Истина);
		Набор.Отбор.Событие.Установить(Выборка.Событие, Истина);
		Набор.Отбор.Уровень.Установить(Выборка.Уровень, Истина);
		Набор.Прочитать();
		Набор.Записать();
	КонецЦикла;

КонецПроцедуры
