#Область ПрикладнойПрограммныйИнтерфейс

#КонецОбласти

#Область ОбщийПрограммныйИнтерфейс

Функция УстановитьРоль() Экспорт 

	
КонецФункции

Функция ПроверитьРоль() Экспорт 

	Возврат Результат(0);

КонецФункции

Функция УдалитьРоль() Экспорт

	//Логика удаления роли
	
	Возврат Результат(1);

КонецФункции

#КонецОбласти

#Область СлужебныеМетоды

Функция ЭтаРоль()

	Результат = Метаданные().ПолноеИмя();
	Результат = Сред(Результат, СтрНайти(Результат, "МенеджерРоли") + 12);
	Возврат Результат;

КонецФункции

Функция ПараметрОперации(ИмяПараметра)

	Для каждого ПараметрОперации Из ПараметрыОперации Цикл
		Если НРег(СокрЛП(ПараметрОперации.Ключ)) = НРег(СокрЛП(ИмяПараметра)) Тогда
			Возврат ПараметрОперации.Значение;
		КонецЕсли;
	КонецЦикла;
	
	Возврат "";

КонецФункции

#КонецОбласти
