Функция КаталогВнешнихДанных() Экспорт

	Возврат Константы.КаталогВнешнихДанных.Получить();

КонецФункции

// Подготавливает стандартный ответ для функции
//Параметры
//	КодВозврата - Число - 0 - ОК, 1 - есть предупреждения, возможно продолжение выполнения, 2 - есть ошибки, продолжение выполнения невозможно
//	ОписаниеОшибки - Строка - Объяснение сусти проблемы, когда КодВозврата <> 0
//	Лог - Строка - Лог выполнения операции, например стандартный вывод, полученный  при выполнении метода УдаленноеУправление.ВыполнитьКомандуCMD
Функция Результат(КодВозврата, ОписаниеОшибки = "", Лог = "") Экспорт

	Возврат Новый Структура("КодВозврата, ОписаниеОшибки, Лог", КодВозврата, ОписаниеОшибки, Лог);

КонецФункции // ()

// ИнтеграцияВЕТИС.Ожидать
Процедура Пауза(ВремяОжидания) Экспорт
	
	Если ВремяОжидания <> 0 Тогда
		
		НастройкиПрокси = Новый ИнтернетПрокси(Ложь);
		НастройкиПрокси.НеИспользоватьПроксиДляЛокальныхАдресов = Истина;
		НастройкиПрокси.НеИспользоватьПроксиДляАдресов.Добавить("127.0.0.0");
		
		Попытка
			Loopback = Новый HTTPСоединение(
				"127.0.0.0",,,,НастройкиПрокси,
				ВремяОжидания);
			Loopback.Получить(Новый HTTPЗапрос());
		Исключение
			ВремяОжидания = 0;
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСкрипт(Идентификатор) Экспорт

	Возврат Справочники.Скрипты.НайтиПоРеквизиту("Идентификатор", Идентификатор).Текст;

КонецФункции
