//Исключение реквизитов при проверке измененности для конкретных видов объектов
//Источник - ДокументОбъект, СправочникОбъект.
//ИсключаемыеРеквизиты - Строка. Наименования реквизитов, которые нужно исключить при определении измененности объекта
Функция ДополнитьИсключаемыеРеквизиты(Источник, ИсключаемыеРеквизиты) Экспорт

	//ИсключаемыеРеквизиты = ИсключаемыеРеквизиты + "Ответственный";
	
КонецФункции

Процедура ВызватьСобытияПередЗаписью(Источник, Замещение = Истина) Экспорт

	ТипЗначения = ТипЗнч(Источник);
	ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗначения);
	
	Если НЕ Источник.ДополнительныеСвойства.Свойство("ВыполненыПроцедурыПередЗаписью") ИЛИ НЕ Источник.ДополнительныеСвойства.ВыполненыПроцедурыПередЗаписью Тогда
		Источник.ДополнительныеСвойства.Вставить("ВыполненыПроцедурыПередЗаписью", Истина);
		Если Метаданные.Справочники.Содержит(ОбъектМетаданных) Тогда
			//ДополнительныеМеханизмыПодписки.ПередЗаписьюСправочника(Источник, Ложь);
		ИначеЕсли Метаданные.Документы.Содержит(ОбъектМетаданных) Тогда
			//ТекущийРежимЗаписи = РежимЗаписиДокумента.Запись;
			//ДополнительныеМеханизмыПодписки.ПередЗаписьюДокумента(Источник, Ложь, ТекущийРежимЗаписи, Неопределено);
		ИначеЕсли Метаданные.РегистрыНакопления.Содержит(ОбъектМетаданных) Тогда
			//ДополнительныеМеханизмыПодписки.ПередЗаписьюРегистраНакопления(Источник, Ложь, Замещение);
		ИначеЕсли Метаданные.РегистрыСведений.Содержит(ОбъектМетаданных) Тогда
			//ДополнительныеМеханизмыПодписки.ПередЗаписьюРегистраСведений(Источник, Ложь);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры
