Функция ПолучитьПравила(ПланОбмена, ВерсияОтправителя, ВерсияПолучателя) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПравилаКонвертацииВерсииОтправителя.Ссылка.ИмяТипа КАК ИмяТипа,
	               |	ПравилаКонвертацииВерсииОтправителя.Ссылка.КодКонвертации КАК Код,
	               |	ПравилаКонвертацииВерсииОтправителя.Ссылка КАК Ссылка,
	               |	ПравилаКонвертацииВерсииОтправителя.Ссылка.ОбменЗапрещен КАК ОбменЗапрещен
	               |ИЗ
	               |	Справочник.ПравилаКонвертации.ВерсииОтправителя КАК ПравилаКонвертацииВерсииОтправителя
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПравилаКонвертации.ВерсииПолучателя КАК ПравилаКонвертацииВерсииПолучателя
	               |		ПО ПравилаКонвертацииВерсииОтправителя.Ссылка = ПравилаКонвертацииВерсииПолучателя.Ссылка
	               |ГДЕ
	               |	ПравилаКонвертацииВерсииОтправителя.Версия = &ВерсияОтправителя
	               |	И ПравилаКонвертацииВерсииПолучателя.Версия = &ВерсияПолучателя
	               |	И ПравилаКонвертацииВерсииОтправителя.Ссылка.ПланОбмена = &ПланОбмена
	               |	И ПравилаКонвертацииВерсииПолучателя.Ссылка.ПланОбмена = &ПланОбмена
	               |	И НЕ ПравилаКонвертацииВерсииОтправителя.Ссылка.ПометкаУдаления
	               |	И НЕ ПравилаКонвертацииВерсииПолучателя.Ссылка.ПометкаУдаления";
	Запрос.УстановитьПараметр("ПланОбмена", ПланОбмена.Ссылка);
	Запрос.УстановитьПараметр("ВерсияОтправителя", ВерсияОтправителя);
	Запрос.УстановитьПараметр("ВерсияПолучателя", ВерсияПолучателя);
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции
