
Процедура ПередЗаписью(Отказ)
	
	Наименование = "" + ПланОбмена.Наименование + "." + ПланОбмена.ИмяПланаОбмена + "." + ИмяТипа + ":";
	
	Версии = "";
	Для каждого ТекущаяСтрока Из ВерсииОтправителя Цикл
		Версии = Версии + "," + ТекущаяСтрока.Версия;
	КонецЦикла;
	Наименование = Наименование + Сред(Версии, 2);
	
	Версии = "";
	Для каждого ТекущаяСтрока Из ВерсииПолучателя Цикл
		Версии = Версии + "," + ТекущаяСтрока.Версия;
	КонецЦикла;
	Наименование = Наименование + "->" + Сред(Версии, 2);
	
КонецПроцедуры
