&НаСервере
Процедура УстановитьПультНаСервере(ПараметрыОперации = Неопределено)
	
	Роль = "Pult";
	Для каждого ТекущаяСтрока Из Элементы.Список.ВыделенныеСтроки Цикл
		РегистрыСведений.РолиКомпьютеров.Назначить(ТекущаяСтрока, Роль);
		СостояниеРоли = РегистрыСведений.РолиКомпьютеров.Состояние(ТекущаяСтрока, Роль);
		Если НЕ СостояниеРоли.Установлена Тогда
			РегистрыСведений.РолиКомпьютеров.НачатьВыполнениеОперации(ТекущаяСтрока, Роль, "УстановитьРоль", ПараметрыОперации);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПульт(Команда)
	УстановитьПультНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПульт(Команда)
	УстановитьПультНаСервере(Новый Структура("Принудительно", "1"));
КонецПроцедуры
