&НаСервере
Процедура ОбменНаСервере(ТекущаяСтрока)

	Узел = ТекущаяСтрока.Узел;
	Попытка
		Результат = КоннекторHTTP.GetJson(Узел.ПолучитьОбъект().Адрес() + "ping");
	Исключение
		Результат = ОписаниеОшибки();
	КонецПопытки;
	
	Если Результат = "Pong" Тогда
		Фастекс.ВыполнитьОбмен(Объект.ПланОбмена, Объект.ПланОбмена.ГлавныйУзел, Узел);
		Фастекс.ВыполнитьОбмен(Объект.ПланОбмена, Узел, Объект.ПланОбмена.ГлавныйУзел);

	Иначе
		Если ПустаяСтрока(Результат) Тогда
			Попытка
				Результат = КоннекторHTTP.Get(Узел.ПолучитьОбъект().Адрес() + "ping");
				Если Результат.КодСостояния = 404 Тогда
					Результат = "Запрашиваемый ресурс не найден";
				КонецЕсли;
			Исключение
				Результат = ОписаниеОшибки();
			КонецПопытки;
		КонецЕсли;
		
		Сообщить("" + Узел.Код + ": не удалось подключиться к ИБ: " + Результат);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Обмен(Команда)
	
	Для каждого ТекущаяСтрока Из Элементы.Список.ВыделенныеСтроки Цикл
		ОбменНаСервере(ТекущаяСтрока);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Очередь_Количество(Команда)
	
	ОткрытьФорму("Обработка.ДлинаОчереди.Форма.ДлинаОчереди", Новый Структура("ПланОбмена, Узел", Объект.ПланОбмена, Элементы.Список.ТекущиеДанные.Узел));
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.ПланОбмена.Пустая() Тогда
		Объект.ПланОбмена = Справочники.ПланыОбменов.НайтиПоНаименованию("Розница");
	КонецЕсли;
	
	Список.Параметры.УстановитьЗначениеПараметра("ПланОбмена", Объект.ПланОбмена);
	
КонецПроцедуры

&НаСервере
Процедура ОбменПоВидуОбъектаНаСервере(ТекущаяСтрока)
	
	Узел1 = Объект.ПланОбмена.ГлавныйУзел;
	Узел2 = ТекущаяСтрока.Узел;
	
	ИмяТипа = Объект.ИмяТипа;
	ИмяТипа = СтрЗаменить(ИмяТипа, "CatalogObject", "Справочник");
	ИмяТипа = СтрЗаменить(ИмяТипа, "DocumentObject", "Документ");
	ИмяТипа = СтрЗаменить(ИмяТипа, "InformationRegisterRecordSet", "РегистрСведений");
	ИмяТипа = СтрЗаменить(ИмяТипа, "AccumulationRegisterRecordSet", "РегистрНакопления");
	ИмяТипа = СтрЗаменить(ИмяТипа, "AccuountingRegisterRecordSet", "РегистрБухгалтерии");
	
	Фастекс.ВыполнитьОбменПоВидуОбъектов(Объект.ПланОбмена.ПолучитьОбъект(), Узел1.ПолучитьОбъект(), Узел2.ПолучитьОбъект(), ИмяТипа, 3);
	Фастекс.ВыполнитьОбменПоВидуОбъектов(Объект.ПланОбмена.ПолучитьОбъект(), Узел2.ПолучитьОбъект(), Узел1.ПолучитьОбъект(), ИмяТипа, 3);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбменПоВидуОбъекта(Команда)
	
	Для каждого ТекущаяСтрока Из Элементы.Список.ВыделенныеСтроки Цикл
		ОбменПоВидуОбъектаНаСервере(ТекущаяСтрока);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.ИмяТипа.СписокВыбора.ЗагрузитьЗначения(Фастекс.СоставОчереди(Объект.ПланОбмена));
	Элементы.ИмяТипа.СписокВыбора.СортироватьПоЗначению();
КонецПроцедуры

&НаКлиенте
Процедура ПланОбменаПриИзменении(Элемент)
	
	Список.Параметры.УстановитьЗначениеПараметра("ПланОбмена", Объект.ПланОбмена);
	Элементы.ИмяТипа.СписокВыбора.ЗагрузитьЗначения(Фастекс.СоставОчереди(Объект.ПланОбмена));
	Элементы.ИмяТипа.СписокВыбора.СортироватьПоЗначению();
	
КонецПроцедуры

