// Область для реалиации логики проверки, установки и удаления

#Область ПрикладнойПрограммныйИнтерфейс

Функция ВыполнитьСкрипт(Знач Компьютер, Знач ИмяФайлаСкрипта, Интерактивно = Ложь, ОтИмениСистемы = Ложь) Экспорт 

	ИмяФайлаСкриптаНаАгенте = УдаленноеУправление.ИмяФайлаНаАгенте(ИмяФайлаСкрипта);
	УдаленноеУправление.СкопироватьФайл(Компьютер, ИмяФайлаСкрипта, ИмяФайлаСкриптаНаАгенте);
	Результат = УдаленноеУправление.ВыполнитьКомандуCMD(Компьютер, СтрШаблон("powershell -ExecutionPolicy RemoteSigned %1; exit", ИмяФайлаСкриптаНаАгенте));
	УдаленноеУправление.УдалитьФайл(Компьютер, ИмяФайлаСкриптаНаАгенте);
	Возврат Результат;

КонецФункции

#КонецОбласти

#Область ОбщийПрограммныйИнтерфейс

Функция УстановитьРоль(Компьютер) Экспорт 

	//Логика установки роли
	
	Возврат Результат(0);
	
КонецФункции

Функция ПроверитьРоль(Компьютер, ИспользоватьКэш = Истина) Экспорт 

	Попытка
		Результат = ВыполнитьСкрипт(Компьютер, УдаленноеУправление.СоздатьСкрипт("get-host | fl version", ".ps1"));
		РегистрыСведений.СвойстваКомпьютеров.ЗаписатьСвойство(Компьютер, , "Powershell", ?(Результат.КодВозврата = 0, 1, 0), Результат.Лог);
		Возврат Результат.КодВозврата = 0;
		
	Исключение
		Возврат Результат(1, ОписаниеОшибки());
		
	КонецПопытки;
	
	Возврат Результат(1, "Не получен ответ от сервера");

КонецФункции

Функция УдалитьРоль(Компьютер) Экспорт

	//Логика удаления роли
	
	Возврат Результат(0);

КонецФункции

#КонецОбласти

#Область СлужебныеМетоды

Функция ЭтаРоль()

	Результат = Метаданные().ПолноеИмя();
	Результат = Сред(Результат, СтрНайти(Результат, "МенеджерРоли") + 12);
	Возврат Результат;

КонецФункции

#КонецОбласти
