// Область для реалиации логики проверки, установки и удаления

#Область ПрикладнойПрограммныйИнтерфейс

Функция Разрядность()

	СистемнаяИнформация = Новый СистемнаяИнформация;
	Возврат ?(СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86, "x86", "x64");

КонецФункции

Функция СкопироватьУстановочныеФайлыJava()

	ИмяФайла = "jre-" + РазрядностьОС() + ".exe";
	Файл = Новый Файл(КаталогФайловОбщий() + "dist\" + ИмяФайла);
	Если НЕ Файл.Существует() Тогда
		Возврат Результат(1, "Не найден файл или нет прав: " + Файл.ПолноеИмя);
	КонецЕсли;
	Файл = Новый Файл(КаталогФайловЛокальный() + ИмяФайла);
	Если НЕ Файл.Существует() Тогда
		Попытка
			КопироватьФайл(КаталогФайловОбщий() + "dist\" + ИмяФайла, КаталогФайловЛокальный() + ИмяФайла);
		Исключение
			Возврат Результат(1, "Не удалось скопировать файл: " + КаталогФайловОбщий() + "dist\" + ИмяФайла + " -> " + КаталогФайловЛокальный() + ИмяФайла);
		КонецПопытки;
	КонецЕсли;
	
	ИмяФайла = "jre.cfg";
	Файл = Новый Файл(КаталогФайловОбщий() + "dist\" + ИмяФайла);
	Если НЕ Файл.Существует() Тогда
		Возврат Результат(1, "Не найден файл или нет прав: " + Файл.ПолноеИмя);
	КонецЕсли;
	Попытка
		КопироватьФайл(КаталогФайловОбщий() + "dist\" + ИмяФайла, КаталогФайловЛокальный() + ИмяФайла);
	Исключение
		Возврат Результат(1, "Не удалось скопировать файл: " + КаталогФайловОбщий() + "dist\" + ИмяФайла + " -> " + КаталогФайловЛокальный() + ИмяФайла);
	КонецПопытки;
	
	Возврат Результат(0);

КонецФункции // ()

Функция ВыполнитьУстановкуJavaВТихомРежиме()

	Возврат ВыполнитьКомандуСистемы("""" + КаталогФайловЛокальный() + "jre-" + РазрядностьОС() + ".exe"" INSTALLCFG=""" + КаталогФайловЛокальный() + "jre.cfg""");

КонецФункции // ()

Функция ПрописатьJAVA_HOME()

	Результат = ВыполнитьКомандуСистемы("setx JAVA_HOME ""c:\Program Files\Java\jre1.8.0_181\bin"" /M");
	//Если НЕ Результат.КодВозврата = 0 Тогда
	     Возврат Результат;
	//КонецЕсли;

	//Возврат ВыполнитьКомандуСистемы("setx PATH ""%PATH%;%JAVA_HOME%\bin"" /M");
	
КонецФункции // ()

#КонецОбласти

#Область ОбщийПрограммныйИнтерфейс

Функция УстановитьРоль(Компьютер) Экспорт 


	Файл = Новый Файл("C:\Program Files\Java\jre1.8.0_181\bin");
	Если Файл.Существует() Тогда
		Возврат Результат(0);
	КонецЕсли;
	
	Результат = СкопироватьУстановочныеФайлыJava();
	Если НЕ Результат.КодВозврата = 0 Тогда
		Возврат Результат;
	КонецЕсли;

	Результат = ВыполнитьУстановкуJavaВТихомРежиме();
	Если НЕ Результат.КодВозврата = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = ПрописатьJAVA_HOME();
	Если НЕ Результат.КодВозврата = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	Возврат Результат(0);
	
КонецФункции

Функция ПроверитьРоль(Компьютер, ИспользоватьКэш = Истина) Экспорт 

	Попытка
		//Логика проверки роли
		
	Исключение
		Возврат Результат(1, ОписаниеОшибки());
		
	КонецПопытки;
	
	Возврат Результат(1, "Не получен ответ от сервера");

КонецФункции

Функция УдалитьРоль(Компьютер) Экспорт

	//Логика удаления роли
	
	Возврат Результат(0);

КонецФункции

#КонецОбласти

#Область СлужебныеМетоды

Функция ЭтаРоль()

	Результат = Метаданные().ПолноеИмя();
	Результат = Сред(Результат, СтрНайти(Результат, "МенеджерРоли") + 12);
	Возврат Результат;

КонецФункции

#КонецОбласти
